garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1575.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM1OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD98">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM1OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM1OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM1OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM1OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM1OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM1OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM1OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM1OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1OFH" edc:desc="" edc:mask="0xff" edc:name="PWM1OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM1TMR" edc:desc="" edc:name="PWM1TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD99">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD99">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM1TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM1TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM1TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM1TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM1TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM1TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrnnn--" edc:cname="PWM1CON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--" edc:name="PWM1CON" edc:nzwidth="8" edc:por="000000--" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM1MODE0" edc:desc="" edc:mask="0x1" edc:name="PWM1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1MODE1" edc:desc="" edc:mask="0x1" edc:name="PWM1MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM1MODE" edc:desc="" edc:mask="0x3" edc:name="PWM1MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PWM1POL" edc:desc="" edc:mask="0x1" edc:name="PWM1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OUT" edc:desc="" edc:mask="0x1" edc:name="PWM1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OE" edc:desc="" edc:mask="0x1" edc:name="PWM1OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1EN" edc:desc="" edc:mask="0x1" edc:name="PWM1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
