garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1575.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="RC3PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RC3PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xEA3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC3PPS" edc:desc="" edc:mask="0xf" edc:name="RC3PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RC3PPS0" edc:desc="" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS1" edc:desc="" edc:mask="0x1" edc:name="RC3PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS2" edc:desc="" edc:mask="0x1" edc:name="RC3PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS3" edc:desc="" edc:mask="0x1" edc:name="RC3PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RC4PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RC4PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xEA4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC4PPS" edc:desc="" edc:mask="0xf" edc:name="RC4PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RC4PPS0" edc:desc="" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS1" edc:desc="" edc:mask="0x1" edc:name="RC4PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS2" edc:desc="" edc:mask="0x1" edc:name="RC4PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS3" edc:desc="" edc:mask="0x1" edc:name="RC4PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RC5PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RC5PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xEA5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC5PPS" edc:desc="" edc:mask="0xf" edc:name="RC5PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RC5PPS0" edc:desc="" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS1" edc:desc="" edc:mask="0x1" edc:name="RC5PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS2" edc:desc="" edc:mask="0x1" edc:name="RC5PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS3" edc:desc="" edc:mask="0x1" edc:name="RC5PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf20" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF80"/>
        <edc:SFRDef edc:access="nnnnnn-n" edc:cname="ICDIO" edc:desc="" edc:impl="0xfd" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxx-x" edc:name="ICDIO" edc:nzwidth="8" edc:por="xxxxxx-x" edc:_addr="0xF8C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ICD_SLRC" edc:desc="" edc:mask="0x1" edc:name="ICD_SLRC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRIS_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="TRIS_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIS_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="TRIS_ICDDAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LAT_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="LAT_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LAT_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="LAT_ICDDAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PORT_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="PORT_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PORT_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="PORT_ICDDAT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n--n" edc:cname="ICDCON0" edc:desc="" edc:impl="0xe9" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxx-x--x" edc:name="ICDCON0" edc:nzwidth="8" edc:por="xxx-x--x" edc:_addr="0xF8D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSTVEC" edc:desc="" edc:mask="0x1" edc:name="RSTVEC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DBGINEX" edc:desc="" edc:mask="0x1" edc:name="DBGINEX" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SSTEP" edc:desc="" edc:mask="0x1" edc:name="SSTEP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FREEZ" edc:desc="" edc:mask="0x1" edc:name="FREEZ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INBUG" edc:desc="" edc:mask="0x1" edc:name="INBUG" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xF8E"/>
        <edc:SFRDef edc:access="nn----n-" edc:cname="ICDSTAT" edc:desc="" edc:impl="0xc2" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx----x-" edc:name="ICDSTAT" edc:nzwidth="8" edc:por="xx----x-" edc:_addr="0xF91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="USRHLTF" edc:desc="" edc:mask="0x1" edc:name="USRHLTF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRP0HLTF" edc:desc="" edc:mask="0x1" edc:name="TRP0HLTF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRP1HLTF" edc:desc="" edc:mask="0x1" edc:name="TRP1HLTF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
